tutorials/fluids/shockTube/shockTube_gas/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application="lowMaDbnsFoam"
cp -r 0.orig 0
runApplication blockMesh
runApplication setFields
runApplication solids4Foam
runApplication foamCalc mag U
runApplication sample
